import Image from 'next/image'
import styles from './ItemCard.module.scss'
const room = require('../../assets/images/room.png');


export const ItemCard = () => {
    return (
        <div className={styles.Card}>
            <Image src={room} alt="" />
            <span>Gold</span>
            <div className={styles.CardContent}>
                <div className={styles.CardHeader}>
                    <div>
                        <span>
                            65.00 BYN
                        </span>

                        <span>
                            за сутки
                        </span>
                    </div>
                    <button>
                        <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <g clip-path="url(#clip0_2831_1903)">
                                <path d="M8.001 0.794922C5.85814 0.794922 4.10645 2.54661 4.10645 4.68949C4.10645 6.83236 5.85814 8.58405 8.001 8.58405C10.1439 8.58405 11.8956 6.83236 11.8956 4.68949C11.8956 2.54661 10.1439 0.794922 8.001 0.794922Z" fill="#686868" />
                                <path d="M14.6852 11.6969C14.5832 11.4418 14.4471 11.2037 14.2941 10.9826C13.5118 9.82616 12.3043 9.06086 10.9438 8.87378C10.7737 8.85679 10.5866 8.89077 10.4506 8.99282C9.73627 9.52004 8.88595 9.79214 8.00157 9.79214C7.1172 9.79214 6.26687 9.52004 5.55258 8.99282C5.41651 8.89077 5.22944 8.83976 5.05938 8.87378C3.69884 9.06086 2.47436 9.82616 1.70906 10.9826C1.556 11.2037 1.41993 11.4588 1.31791 11.6969C1.2669 11.799 1.2839 11.918 1.3349 12.0201C1.47097 12.2582 1.64102 12.4963 1.79408 12.7003C2.03217 13.0235 2.28728 13.3126 2.57641 13.5847C2.81449 13.8228 3.0866 14.0439 3.35873 14.265C4.70225 15.2684 6.31791 15.7956 7.98458 15.7956C9.65125 15.7956 11.2669 15.2684 12.6104 14.265C12.8825 14.0609 13.1546 13.8228 13.3927 13.5847C13.6649 13.3126 13.937 13.0235 14.1751 12.7003C14.3451 12.4793 14.4982 12.2582 14.6343 12.0201C14.7192 11.918 14.7362 11.7989 14.6852 11.6969Z" fill="#686868" />
                            </g>
                            <defs>
                                <clipPath id="clip0_2831_1903">
                                    <rect width="15" height="15" fill="white" transform="translate(0.5 0.794922)" />
                                </clipPath>
                            </defs>
                        </svg>

                        <span>
                            4 (2+2)
                        </span>
                    </button>


                    <button>
                        4 комн.

                    </button>
                    <button>
                        179 м²
                    </button>
                </div>
                <div className={styles.CardAdress}>
                    <div className={styles.CardAdressFull}>
                        <svg width="13" height="16" viewBox="0 0 13 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M11.462 3.15505C10.3632 1.42457 8.54923 0.451172 6.50853 0.451172C4.48528 0.451172 2.67132 1.42457 1.5376 3.15505C0.403882 4.84949 0.142254 7.01259 0.839929 8.90531C1.03179 9.41004 1.3283 9.93279 1.71202 10.4015L6.12481 15.7732C6.22946 15.8813 6.33412 15.9534 6.49109 15.9534C6.64807 15.9534 6.75272 15.8813 6.85737 15.7732L11.2876 10.4015C11.6713 9.93279 11.9853 9.42806 12.1597 8.90531C12.8574 7.01259 12.5957 4.84949 11.462 3.15505ZM6.50853 9.53622C5.00853 9.53622 3.77016 8.25638 3.77016 6.70615C3.77016 5.15593 5.00853 3.87609 6.50853 3.87609C8.00853 3.87609 9.24691 5.15593 9.24691 6.70615C9.24691 8.25638 8.02598 9.53622 6.50853 9.53622Z" fill="#BDBDBD" />
                        </svg>

                        <span>Минск, б-р Мулявина, д. 10</span>
                    </div>
                    <div className={styles.CardAdressMetro}>
                        <svg width="20" height="13" viewBox="0 0 20 13" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M19.6401 11.4773H18.3812L14.4755 0.509766L9.99979 7.19943L5.21594 0.589264L1.61882 11.4773H0.359905L0 12.9373H4.77911L6.65514 7.59981L10.0565 12.2942L10.0769 12.3238L10.0978 12.2942L13.3449 7.59981L15.2209 12.9373H20L19.6401 11.4773Z" fill="#BDBDBD" />
                        </svg>
                        <span>Грушевка</span>
                    </div>
                    <div className={styles.CardAdressDistrict}>
                        Шабаны
                    </div>


                </div>
                <p className={styles.CardDescription}>
                    Какое-то описание квартиры, описание квартиры, описание квартиры, описание квартиры, описание квартиры, описание квартиры, описание квартиры, описание квартиры, описание квартиры, описание ...
                </p>


                <div className={styles.CardContentFooter}>
                    <button className={styles.ContactsButton}>
                        <svg width="9" height="16" viewBox="0 0 9 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M7.18253 0.349609H1.72797C0.787063 0.349609 0.0234375 1.11324 0.0234375 2.05415L0.0234375 13.6451C0.0234375 14.586 0.787063 15.3496 1.72797 15.3496H7.18253C8.12344 15.3496 8.88707 14.586 8.88707 13.6451V2.05415C8.88707 1.11324 8.12344 0.349609 7.18253 0.349609ZM4.45527 14.6678C3.88935 14.6678 3.43254 14.211 3.43254 13.6451C3.43254 13.0792 3.88935 12.6223 4.45527 12.6223C5.02119 12.6223 5.478 13.0792 5.478 13.6451C5.478 14.211 5.02116 14.6678 4.45527 14.6678ZM7.52345 11.9405H1.38709V2.39507H7.52345V11.9405Z" fill="#664EF9" />
                        </svg>
                        <span>
                            Контакты
                        </span>

                    </button>
                    <button className={styles.ReadMoreButton}>Подробнее</button>
                </div>

            </div>
        </div>
    )
}
